k6-s2.log
[INFO] issuing token from auth...
pod/get-token created
TOKEN_LEN=140
JWT_PARTS=3

[K8S] 2026-01-31T11:42:04Z
[K8S] employee scalers:
[K8S] employee pods:
NAME                                                   READY   STATUS    RESTARTS   AGE     IP                NODE      NOMINATED NODE   READINESS GATES
onprem-dev-employee-employee-server-65bc9744c5-gs8k9   1/1     Running   0          2m23s   192.168.189.115   worker2   <none>           <none>

[INFO] quick check /employees (non-fatal)...
HTTP=200
pod "emp-check" deleted
[INFO] start k6: RATE=300 DURATION=2m
[INFO] starting k8s watcher (every 5s)...
[K8S] pods_ready=1/1

running (0m01.0s), 0296/0300 VUs, 3 complete and 0 interrupted iterations
steady   [   1% ] 0296/0300 VUs  0m01.0s/2m0s  300.00 iters/s

running (0m02.0s), 0448/0448 VUs, 3 complete and 0 interrupted iterations
steady   [   2% ] 0448/0448 VUs  0m02.0s/2m0s  300.00 iters/s

running (0m03.0s), 0598/0598 VUs, 3 complete and 0 interrupted iterations
steady   [   2% ] 0598/0598 VUs  0m03.0s/2m0s  300.00 iters/s

running (0m04.0s), 0747/0748 VUs, 3 complete and 0 interrupted iterations
steady   [   3% ] 0747/0748 VUs  0m04.0s/2m0s  300.00 iters/s
[K8S] pods_ready=1/1

running (0m05.0s), 0897/0898 VUs, 3 complete and 0 interrupted iterations
steady   [   4% ] 0898/0898 VUs  0m05.0s/2m0s  300.00 iters/s

running (0m06.0s), 1047/1047 VUs, 4 complete and 0 interrupted iterations
steady   [   5% ] 1047/1047 VUs  0m06.0s/2m0s  300.00 iters/s

running (0m07.0s), 1197/1197 VUs, 4 complete and 0 interrupted iterations
steady   [   6% ] 1197/1197 VUs  0m07.0s/2m0s  300.00 iters/s

running (0m08.0s), 1199/1288 VUs, 210 complete and 0 interrupted iterations
steady   [   7% ] 1199/1288 VUs  0m08.0s/2m0s  300.00 iters/s

running (0m09.0s), 1393/1394 VUs, 210 complete and 0 interrupted iterations
steady   [   7% ] 1394/1394 VUs  0m09.0s/2m0s  300.00 iters/s
[K8S] pods_ready=1/1

running (0m10.0s), 1544/1544 VUs, 210 complete and 0 interrupted iterations
steady   [   8% ] 1544/1544 VUs  0m10.0s/2m0s  300.00 iters/s

running (0m11.0s), 1651/1652 VUs, 295 complete and 0 interrupted iterations
steady   [   9% ] 1651/1652 VUs  0m11.0s/2m0s  300.00 iters/s

running (0m12.0s), 1724/1725 VUs, 449 complete and 0 interrupted iterations
steady   [  10% ] 1724/1725 VUs  0m12.0s/2m0s  300.00 iters/s

running (0m13.0s), 1764/1765 VUs, 668 complete and 0 interrupted iterations
steady   [  11% ] 1764/1765 VUs  0m13.0s/2m0s  300.00 iters/s

running (0m14.0s), 1807/1808 VUs, 879 complete and 0 interrupted iterations
steady   [  12% ] 1807/1808 VUs  0m14.0s/2m0s  300.00 iters/s
[K8S] pods_ready=1/1

running (0m15.0s), 1840/1858 VUs, 1097 complete and 0 interrupted iterations
steady   [  12% ] 1840/1858 VUs  0m15.0s/2m0s  300.00 iters/s

running (0m16.0s), 1923/1924 VUs, 1247 complete and 0 interrupted iterations
steady   [  13% ] 1923/1924 VUs  0m16.0s/2m0s  300.00 iters/s

running (0m17.0s), 1999/1999 VUs, 1397 complete and 0 interrupted iterations
steady   [  14% ] 1999/1999 VUs  0m17.0s/2m0s  300.00 iters/s

running (0m18.0s), 1903/2000 VUs, 1759 complete and 0 interrupted iterations
steady   [  15% ] 1903/2000 VUs  0m18.0s/2m0s  300.00 iters/s

running (0m19.0s), 1898/2000 VUs, 2065 complete and 0 interrupted iterations
steady   [  16% ] 1898/2000 VUs  0m19.0s/2m0s  300.00 iters/s
[K8S] pods_ready=1/1

running (0m20.0s), 1950/2000 VUs, 2312 complete and 0 interrupted iterations
steady   [  17% ] 1950/2000 VUs  0m20.0s/2m0s  300.00 iters/s

running (0m21.0s), 1918/2000 VUs, 2556 complete and 0 interrupted iterations
steady   [  17% ] 1918/2000 VUs  0m21.0s/2m0s  300.00 iters/s

running (0m22.0s), 1957/2000 VUs, 2810 complete and 0 interrupted iterations
steady   [  18% ] 1957/2000 VUs  0m22.0s/2m0s  300.00 iters/s

running (0m23.0s), 1706/2000 VUs, 3360 complete and 0 interrupted iterations
steady   [  19% ] 1706/2000 VUs  0m23.0s/2m0s  300.00 iters/s

running (0m24.0s), 1828/2000 VUs, 3539 complete and 0 interrupted iterations
steady   [  20% ] 1828/2000 VUs  0m24.0s/2m0s  300.00 iters/s
[K8S] pods_ready=1/1

running (0m25.0s), 1934/2000 VUs, 3733 complete and 0 interrupted iterations
steady   [  21% ] 1934/2000 VUs  0m25.0s/2m0s  300.00 iters/s

running (0m26.0s), 1999/2000 VUs, 3937 complete and 0 interrupted iterations
steady   [  22% ] 2000/2000 VUs  0m26.0s/2m0s  300.00 iters/s

running (0m27.0s), 1998/2000 VUs, 4074 complete and 0 interrupted iterations
steady   [  22% ] 1998/2000 VUs  0m27.0s/2m0s  300.00 iters/s

running (0m28.0s), 1999/2000 VUs, 4245 complete and 0 interrupted iterations
steady   [  23% ] 1999/2000 VUs  0m28.0s/2m0s  300.00 iters/s

running (0m29.0s), 1915/2000 VUs, 4531 complete and 0 interrupted iterations
steady   [  24% ] 1915/2000 VUs  0m29.0s/2m0s  300.00 iters/s
[K8S] pods_ready=1/1

running (0m30.0s), 1937/2000 VUs, 4809 complete and 0 interrupted iterations
steady   [  25% ] 1937/2000 VUs  0m30.0s/2m0s  300.00 iters/s

running (0m31.0s), 1853/2000 VUs, 5193 complete and 0 interrupted iterations
steady   [  26% ] 1853/2000 VUs  0m31.0s/2m0s  300.00 iters/s

running (0m32.0s), 1634/2000 VUs, 5712 complete and 0 interrupted iterations
steady   [  27% ] 1634/2000 VUs  0m32.0s/2m0s  300.00 iters/s

running (0m33.0s), 1665/2000 VUs, 5981 complete and 0 interrupted iterations
steady   [  27% ] 1665/2000 VUs  0m33.0s/2m0s  300.00 iters/s

running (0m34.0s), 1725/2000 VUs, 6220 complete and 0 interrupted iterations
steady   [  28% ] 1725/2000 VUs  0m34.0s/2m0s  300.00 iters/s
[K8S] pods_ready=1/1

running (0m35.0s), 1730/2000 VUs, 6516 complete and 0 interrupted iterations
steady   [  29% ] 1730/2000 VUs  0m35.0s/2m0s  300.00 iters/s

running (0m36.0s), 1509/2000 VUs, 7036 complete and 0 interrupted iterations
steady   [  30% ] 1509/2000 VUs  0m36.0s/2m0s  300.00 iters/s

running (0m37.0s), 1445/2000 VUs, 7400 complete and 0 interrupted iterations
steady   [  31% ] 1445/2000 VUs  0m37.0s/2m0s  300.00 iters/s

running (0m38.0s), 1460/2000 VUs, 7686 complete and 0 interrupted iterations
steady   [  32% ] 1460/2000 VUs  0m38.0s/2m0s  300.00 iters/s

running (0m39.0s), 1290/2000 VUs, 8156 complete and 0 interrupted iterations
steady   [  32% ] 1290/2000 VUs  0m39.0s/2m0s  300.00 iters/s
[K8S] pods_ready=1/1

running (0m40.0s), 1221/2000 VUs, 8525 complete and 0 interrupted iterations
steady   [  33% ] 1221/2000 VUs  0m40.0s/2m0s  300.00 iters/s

running (0m41.0s), 1221/2000 VUs, 8825 complete and 0 interrupted iterations
steady   [  34% ] 1221/2000 VUs  0m41.0s/2m0s  300.00 iters/s

running (0m42.0s), 1217/2000 VUs, 9129 complete and 0 interrupted iterations
steady   [  35% ] 1217/2000 VUs  0m42.0s/2m0s  300.00 iters/s

running (0m43.0s), 1063/2000 VUs, 9583 complete and 0 interrupted iterations
steady   [  36% ] 1063/2000 VUs  0m43.0s/2m0s  300.00 iters/s

running (0m44.0s), 0182/2000 VUs, 10763 complete and 0 interrupted iterations
steady   [  37% ] 0182/2000 VUs  0m44.0s/2m0s  300.00 iters/s

running (0m45.0s), 0145/2000 VUs, 11101 complete and 0 interrupted iterations
steady   [  37% ] 0145/2000 VUs  0m45.0s/2m0s  300.00 iters/s
[K8S] pods_ready=1/1

running (0m46.0s), 0174/2000 VUs, 11371 complete and 0 interrupted iterations
steady   [  38% ] 0174/2000 VUs  0m46.0s/2m0s  300.00 iters/s

running (0m47.0s), 0185/2000 VUs, 11661 complete and 0 interrupted iterations
steady   [  39% ] 0185/2000 VUs  0m47.0s/2m0s  300.00 iters/s

running (0m48.0s), 0021/2000 VUs, 12124 complete and 0 interrupted iterations
steady   [  40% ] 0021/2000 VUs  0m48.0s/2m0s  300.00 iters/s

running (0m49.0s), 0108/2000 VUs, 12338 complete and 0 interrupted iterations
steady   [  41% ] 0108/2000 VUs  0m49.0s/2m0s  300.00 iters/s

running (0m50.0s), 0334/2000 VUs, 12411 complete and 0 interrupted iterations
steady   [  42% ] 0334/2000 VUs  0m50.0s/2m0s  300.00 iters/s
[K8S] pods_ready=1/1

running (0m51.0s), 0634/2000 VUs, 12411 complete and 0 interrupted iterations
steady   [  42% ] 0634/2000 VUs  0m51.0s/2m0s  300.00 iters/s

running (0m52.0s), 0934/2000 VUs, 12411 complete and 0 interrupted iterations
steady   [  43% ] 0934/2000 VUs  0m52.0s/2m0s  300.00 iters/s

running (0m53.0s), 1235/2000 VUs, 12411 complete and 0 interrupted iterations
steady   [  44% ] 1235/2000 VUs  0m53.0s/2m0s  300.00 iters/s

running (0m54.0s), 1534/2000 VUs, 12411 complete and 0 interrupted iterations
steady   [  45% ] 1534/2000 VUs  0m54.0s/2m0s  300.00 iters/s

running (0m55.0s), 1834/2000 VUs, 12411 complete and 0 interrupted iterations
steady   [  46% ] 1834/2000 VUs  0m55.0s/2m0s  300.00 iters/s
[K8S] pods_ready=1/1

running (0m56.0s), 2000/2000 VUs, 12411 complete and 0 interrupted iterations
steady   [  47% ] 2000/2000 VUs  0m56.0s/2m0s  300.00 iters/s

running (0m57.0s), 2000/2000 VUs, 12411 complete and 0 interrupted iterations
steady   [  47% ] 2000/2000 VUs  0m57.0s/2m0s  300.00 iters/s

running (0m58.0s), 2000/2000 VUs, 12412 complete and 0 interrupted iterations
steady   [  48% ] 2000/2000 VUs  0m58.0s/2m0s  300.00 iters/s

running (0m59.0s), 1960/2000 VUs, 12556 complete and 0 interrupted iterations
steady   [  49% ] 1960/2000 VUs  0m59.0s/2m0s  300.00 iters/s

running (1m00.0s), 1721/2000 VUs, 13095 complete and 0 interrupted iterations
steady   [  50% ] 1721/2000 VUs  1m00.0s/2m0s  300.00 iters/s
[K8S] pods_ready=1/1

running (1m01.0s), 1421/2000 VUs, 13695 complete and 0 interrupted iterations
steady   [  51% ] 1421/2000 VUs  1m01.0s/2m0s  300.00 iters/s

running (1m02.0s), 1120/2000 VUs, 14295 complete and 0 interrupted iterations
steady   [  52% ] 1120/2000 VUs  1m02.0s/2m0s  300.00 iters/s

running (1m03.0s), 1027/2000 VUs, 14689 complete and 0 interrupted iterations
steady   [  52% ] 1027/2000 VUs  1m03.0s/2m0s  300.00 iters/s

running (1m04.0s), 1026/2000 VUs, 14989 complete and 0 interrupted iterations
steady   [  53% ] 1026/2000 VUs  1m04.0s/2m0s  300.00 iters/s

running (1m05.0s), 1027/2000 VUs, 15289 complete and 0 interrupted iterations
steady   [  54% ] 1027/2000 VUs  1m05.0s/2m0s  300.00 iters/s
[K8S] pods_ready=1/1

running (1m06.0s), 1158/2000 VUs, 15458 complete and 0 interrupted iterations
steady   [  55% ] 1158/2000 VUs  1m06.0s/2m0s  300.00 iters/s

running (1m07.0s), 1458/2000 VUs, 15458 complete and 0 interrupted iterations
steady   [  56% ] 1458/2000 VUs  1m07.0s/2m0s  300.00 iters/s

running (1m08.0s), 1672/2000 VUs, 15544 complete and 0 interrupted iterations
steady   [  57% ] 1672/2000 VUs  1m08.0s/2m0s  300.00 iters/s

running (1m09.0s), 1084/2000 VUs, 16432 complete and 0 interrupted iterations
steady   [  57% ] 1084/2000 VUs  1m09.0s/2m0s  300.00 iters/s

running (1m10.0s), 0949/2000 VUs, 16867 complete and 0 interrupted iterations
steady   [  58% ] 0949/2000 VUs  1m10.0s/2m0s  300.00 iters/s
[K8S] pods_ready=1/1

running (1m11.0s), 1248/2000 VUs, 16867 complete and 0 interrupted iterations
steady   [  59% ] 1248/2000 VUs  1m11.0s/2m0s  300.00 iters/s

running (1m12.0s), 1290/2000 VUs, 17126 complete and 0 interrupted iterations
steady   [  60% ] 1290/2000 VUs  1m12.0s/2m0s  300.00 iters/s

running (1m13.0s), 1432/2000 VUs, 17283 complete and 0 interrupted iterations
steady   [  61% ] 1432/2000 VUs  1m13.0s/2m0s  300.00 iters/s

running (1m14.0s), 1558/2000 VUs, 17457 complete and 0 interrupted iterations
steady   [  62% ] 1559/2000 VUs  1m14.0s/2m0s  300.00 iters/s

running (1m15.0s), 1405/2000 VUs, 17910 complete and 0 interrupted iterations
steady   [  62% ] 1405/2000 VUs  1m15.0s/2m0s  300.00 iters/s
[K8S] pods_ready=1/1

running (1m16.0s), 1308/2000 VUs, 18308 complete and 0 interrupted iterations
steady   [  63% ] 1308/2000 VUs  1m16.0s/2m0s  300.00 iters/s

running (1m17.0s), 1246/2000 VUs, 18669 complete and 0 interrupted iterations
steady   [  64% ] 1246/2000 VUs  1m17.0s/2m0s  300.00 iters/s

running (1m18.0s), 1213/2000 VUs, 19002 complete and 0 interrupted iterations
steady   [  65% ] 1213/2000 VUs  1m18.0s/2m0s  300.00 iters/s

running (1m19.0s), 1198/2000 VUs, 19317 complete and 0 interrupted iterations
steady   [  66% ] 1198/2000 VUs  1m19.0s/2m0s  300.00 iters/s

running (1m20.0s), 0669/2000 VUs, 20147 complete and 0 interrupted iterations
steady   [  67% ] 0669/2000 VUs  1m20.0s/2m0s  300.00 iters/s
[K8S] pods_ready=1/1

running (1m21.0s), 0947/2000 VUs, 20169 complete and 0 interrupted iterations
steady   [  67% ] 0947/2000 VUs  1m21.0s/2m0s  300.00 iters/s

running (1m22.0s), 0906/2000 VUs, 20510 complete and 0 interrupted iterations
steady   [  68% ] 0906/2000 VUs  1m22.0s/2m0s  300.00 iters/s

running (1m23.0s), 0871/2000 VUs, 20845 complete and 0 interrupted iterations
steady   [  69% ] 0871/2000 VUs  1m23.0s/2m0s  300.00 iters/s

running (1m24.0s), 0756/2000 VUs, 21259 complete and 0 interrupted iterations
steady   [  70% ] 0756/2000 VUs  1m24.0s/2m0s  300.00 iters/s

running (1m25.0s), 1057/2000 VUs, 21259 complete and 0 interrupted iterations
steady   [  71% ] 1057/2000 VUs  1m25.0s/2m0s  300.00 iters/s
[K8S] pods_ready=1/1

running (1m26.0s), 1356/2000 VUs, 21259 complete and 0 interrupted iterations
steady   [  72% ] 1357/2000 VUs  1m26.0s/2m0s  300.00 iters/s

running (1m27.0s), 1656/2000 VUs, 21259 complete and 0 interrupted iterations
steady   [  72% ] 1656/2000 VUs  1m27.0s/2m0s  300.00 iters/s

running (1m28.0s), 1900/2000 VUs, 21316 complete and 0 interrupted iterations
steady   [  73% ] 1900/2000 VUs  1m28.0s/2m0s  300.00 iters/s

running (1m29.0s), 1899/2000 VUs, 21616 complete and 0 interrupted iterations
steady   [  74% ] 1899/2000 VUs  1m29.0s/2m0s  300.00 iters/s

running (1m30.0s), 1739/2000 VUs, 22077 complete and 0 interrupted iterations
steady   [  75% ] 1739/2000 VUs  1m30.0s/2m0s  300.00 iters/s
[K8S] pods_ready=1/1

running (1m31.0s), 1538/2000 VUs, 22577 complete and 0 interrupted iterations
steady   [  76% ] 1538/2000 VUs  1m31.0s/2m0s  300.00 iters/s

running (1m32.0s), 1462/2000 VUs, 22953 complete and 0 interrupted iterations
steady   [  77% ] 1462/2000 VUs  1m32.0s/2m0s  300.00 iters/s

running (1m33.0s), 1311/2000 VUs, 23404 complete and 0 interrupted iterations
steady   [  77% ] 1311/2000 VUs  1m33.0s/2m0s  300.00 iters/s

running (1m34.0s), 1039/2000 VUs, 23977 complete and 0 interrupted iterations
steady   [  78% ] 1039/2000 VUs  1m34.0s/2m0s  300.00 iters/s

running (1m35.0s), 1081/2000 VUs, 24235 complete and 0 interrupted iterations
steady   [  79% ] 1081/2000 VUs  1m35.0s/2m0s  300.00 iters/s
[K8S] pods_ready=1/1

running (1m36.0s), 1033/2000 VUs, 24583 complete and 0 interrupted iterations
steady   [  80% ] 1033/2000 VUs  1m36.0s/2m0s  300.00 iters/s

running (1m37.0s), 1027/2000 VUs, 24889 complete and 0 interrupted iterations
steady   [  81% ] 1027/2000 VUs  1m37.0s/2m0s  300.00 iters/s

running (1m38.0s), 1085/2000 VUs, 25130 complete and 0 interrupted iterations
steady   [  82% ] 1085/2000 VUs  1m38.0s/2m0s  300.00 iters/s

running (1m39.0s), 1386/2000 VUs, 25130 complete and 0 interrupted iterations
steady   [  82% ] 1386/2000 VUs  1m39.0s/2m0s  300.00 iters/s

running (1m40.0s), 0661/2000 VUs, 26154 complete and 0 interrupted iterations
steady   [  83% ] 0661/2000 VUs  1m40.0s/2m0s  300.00 iters/s
[K8S] pods_ready=1/1

running (1m41.0s), 0940/2000 VUs, 26175 complete and 0 interrupted iterations
steady   [  84% ] 0940/2000 VUs  1m41.0s/2m0s  300.00 iters/s

running (1m42.0s), 1220/2000 VUs, 26195 complete and 0 interrupted iterations
steady   [  85% ] 1220/2000 VUs  1m42.0s/2m0s  300.00 iters/s

running (1m43.0s), 1016/2000 VUs, 26699 complete and 0 interrupted iterations
steady   [  86% ] 1017/2000 VUs  1m43.0s/2m0s  300.00 iters/s

running (1m44.0s), 1103/2000 VUs, 26913 complete and 0 interrupted iterations
steady   [  87% ] 1103/2000 VUs  1m44.0s/2m0s  300.00 iters/s

running (1m45.0s), 1306/2000 VUs, 27010 complete and 0 interrupted iterations
steady   [  87% ] 1306/2000 VUs  1m45.0s/2m0s  300.00 iters/s
[K8S] pods_ready=1/1

running (1m46.0s), 1531/2000 VUs, 27084 complete and 0 interrupted iterations
steady   [  88% ] 1531/2000 VUs  1m46.0s/2m0s  300.00 iters/s

running (1m47.0s), 1586/2000 VUs, 27329 complete and 0 interrupted iterations
steady   [  89% ] 1586/2000 VUs  1m47.0s/2m0s  300.00 iters/s

running (1m48.0s), 1527/2000 VUs, 27689 complete and 0 interrupted iterations
steady   [  90% ] 1527/2000 VUs  1m48.0s/2m0s  300.00 iters/s

running (1m49.0s), 1460/2000 VUs, 28056 complete and 0 interrupted iterations
steady   [  91% ] 1460/2000 VUs  1m49.0s/2m0s  300.00 iters/s

running (1m50.0s), 1384/2000 VUs, 28432 complete and 0 interrupted iterations
steady   [  92% ] 1384/2000 VUs  1m50.0s/2m0s  300.00 iters/s
[K8S] pods_ready=1/1

running (1m51.0s), 1255/2000 VUs, 28861 complete and 0 interrupted iterations
steady   [  92% ] 1255/2000 VUs  1m51.0s/2m0s  300.00 iters/s

running (1m52.0s), 1195/2000 VUs, 29221 complete and 0 interrupted iterations
steady   [  93% ] 1195/2000 VUs  1m52.0s/2m0s  300.00 iters/s

running (1m53.0s), 1016/2000 VUs, 29700 complete and 0 interrupted iterations
steady   [  94% ] 1016/2000 VUs  1m53.0s/2m0s  300.00 iters/s

running (1m54.0s), 0752/2000 VUs, 30264 complete and 0 interrupted iterations
steady   [  95% ] 0752/2000 VUs  1m54.0s/2m0s  300.00 iters/s

running (1m55.0s), 0560/2000 VUs, 30756 complete and 0 interrupted iterations
steady   [  96% ] 0560/2000 VUs  1m55.0s/2m0s  300.00 iters/s

running (1m56.0s), 0622/2000 VUs, 30994 complete and 0 interrupted iterations
steady   [  97% ] 0622/2000 VUs  1m56.0s/2m0s  300.00 iters/s
[K8S] pods_ready=1/1

running (1m57.0s), 0786/2000 VUs, 31130 complete and 0 interrupted iterations
steady   [  97% ] 0786/2000 VUs  1m57.0s/2m0s  300.00 iters/s

running (1m58.0s), 1086/2000 VUs, 31130 complete and 0 interrupted iterations
steady   [  98% ] 1086/2000 VUs  1m58.0s/2m0s  300.00 iters/s

running (1m59.0s), 1386/2000 VUs, 31130 complete and 0 interrupted iterations
steady   [  99% ] 1386/2000 VUs  1m59.0s/2m0s  300.00 iters/s

running (2m00.0s), 1541/2000 VUs, 31274 complete and 0 interrupted iterations
steady   [ 100% ] 1541/2000 VUs  2m00.0s/2m0s  300.00 iters/s

running (2m01.0s), 1495/2000 VUs, 31323 complete and 0 interrupted iterations
steady ↓ [ 100% ] 1544/2000 VUs  2m0s  300.00 iters/s
[K8S] pods_ready=1/1

running (2m02.0s), 1472/2000 VUs, 31346 complete and 0 interrupted iterations
steady ↓ [ 100% ] 1544/2000 VUs  2m0s  300.00 iters/s

running (2m03.0s), 0999/2000 VUs, 31819 complete and 0 interrupted iterations
steady ↓ [ 100% ] 1544/2000 VUs  2m0s  300.00 iters/s

running (2m04.0s), 0933/2000 VUs, 31885 complete and 0 interrupted iterations
steady ↓ [ 100% ] 1544/2000 VUs  2m0s  300.00 iters/s

running (2m05.0s), 0678/2000 VUs, 32140 complete and 0 interrupted iterations
steady ↓ [ 100% ] 1544/2000 VUs  2m0s  300.00 iters/s

running (2m06.0s), 0484/2000 VUs, 32334 complete and 0 interrupted iterations
steady ↓ [ 100% ] 1544/2000 VUs  2m0s  300.00 iters/s
[K8S] pods_ready=1/1

running (2m07.0s), 0351/2000 VUs, 32467 complete and 0 interrupted iterations
steady ↓ [ 100% ] 1544/2000 VUs  2m0s  300.00 iters/s

running (2m08.0s), 0186/2000 VUs, 32632 complete and 0 interrupted iterations
steady ↓ [ 100% ] 1544/2000 VUs  2m0s  300.00 iters/s

running (2m09.0s), 0026/2000 VUs, 32792 complete and 0 interrupted iterations
steady ↓ [ 100% ] 1544/2000 VUs  2m0s  300.00 iters/s

running (2m10.0s), 0000/2000 VUs, 32818 complete and 0 interrupted iterations
steady ✓ [ 100% ] 0000/2000 VUs  2m0s  300.00 iters/s

     ✗ status is 200
      ↳  0% — ✓ 210 / ✗ 32608

     checks.........................: 0.63%  ✓ 210        ✗ 32608 
     data_received..................: 4.2 MB 32 kB/s
     data_sent......................: 8.6 MB 66 kB/s
     dropped_iterations.............: 3183   24.486005/s
     http_req_blocked...............: avg=523.39µs min=852ns    med=3.81µs  max=308.26ms p(90)=221.99µs p(95)=257.38µs
     http_req_connecting............: avg=80.66µs  min=0s       med=0s      max=9.78ms   p(90)=182.47µs p(95)=212.98µs
     http_req_duration..............: avg=4.9s     min=126.16µs med=4.21s   max=10.01s   p(90)=10s      p(95)=10s     
       { expected_response:true }...: avg=7.08s    min=511.54ms med=7.25s   max=7.3s     p(90)=7.3s     p(95)=7.3s    
     http_req_failed................: 99.36% ✓ 32608      ✗ 210   
     http_req_receiving.............: avg=6.34ms   min=0s       med=10.94µs max=2.43s    p(90)=31.29µs  p(95)=38.09µs 
     http_req_sending...............: avg=18.16µs  min=3.26µs   med=14.83µs max=2.07ms   p(90)=31.81µs  p(95)=38.52µs 
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=4.89s    min=109.13µs med=4.21s   max=10.01s   p(90)=10s      p(95)=10s     
     http_reqs......................: 32818  252.460478/s
     iteration_duration.............: avg=4.91s    min=10.19ms  med=4.22s   max=10.02s   p(90)=10.01s   p(95)=10.01s  
     iterations.....................: 32818  252.460478/s
     vus............................: 26     min=21       max=2000
     vus_max........................: 2000   min=300      max=2000


running (2m10.0s), 0000/2000 VUs, 32818 complete and 0 interrupted iterations
steady ✓ [ 100% ] 0000/2000 VUs  2m0s  300.00 iters/s
[K8S] pods_ready=1/1
pod "k6-employees" deleted

[K8S] 2026-01-31T11:44:23Z
[K8S] employee scalers:
[K8S] employee pods:
NAME                                                   READY   STATUS    RESTARTS   AGE     IP                NODE      NOMINATED NODE   READINESS GATES
onprem-dev-employee-employee-server-65bc9744c5-gs8k9   1/1     Running   0          4m42s   192.168.189.115   worker2   <none>           <none>